app/controllers/categories_controller.rb

	def index
		@cate = Category.all
---
SELECT "categories".* FROM "categories"