app/controllers/products_controller.rb

def index
	if params[:nombre]
		@prod=Product.where("nombre like '%#{params[:nombre]}%'")
---
SELECT "products".* FROM "products"  WHERE (nombre like '%marco%' ) AND (vencimiento> '2015-10-18')  ORDER BY vencimiento desc

def show
	@prod = Product.find(params[:id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ?  ORDER BY created_at desc LIMIT 1  [["id", 12]]